package com.whiteursa.andromate.weather;

public class ClothesChooser {
    private String[] manHot = {"Обычная футболка", "Объемные шорты",
    "Парка с капюшоном", "Козырек или косынка", "Солнцезащитные очки",
    "Мягкая обувь на плоской подошве", "Кардиган",  "Рубашка"};

    private String[] womanHot = {"Обычная футболка" , "Бретонка",
    "Льняная рубашка", "Маленькое простое платье", "Платья-туники", "Белые джинсы",
    "Брюки чинос", "Шорты", "Жакет и джинсовая куртка", "Flats",
    "Сандалии", "Эспадрильи", "Кеды на плоской подошве", "Классические босоножки на каблуке",
    "Палантины", "Платки", "Банданы", "Кардиган"};

    private String[] manCool = {"Классическое пальто", "Жакет", "Брюки", "Рубашка",
    "Объемный свитер", "Лоферы", "Армейские ботинки", "Челси", "Шапка-бини",
    "Джинсы", "Лонгслив", "Джемпер", "Броки чинос", "Шарф"};

    private String[] womanCool = {"Классическое пальто", "Жакет", "Брюки",
    "Юбка средней длины", "Платье из плотной ткани", "Рубашка","Шапка-бини", "Джинсы",
    "Классическая юбка-карандаш с завышенной талией", "Тренч", "Кашемировый свитер",
    "Платье А-образного силуэта",  "Шарф"};

    private String[] manCold = {"Парка", "Пальто", "Рубашка", "Лонгслив", "Пуловер",
    "Джинсы", "Классические брюки", "Ботинки", "Зимняя куртка", "Мужская дубленка",
    "Ботинки-дезерты", "Джемпер с круглым или V-образным вырезом", "Кардиган"};

    private String[] womanCold = {"Блузка с длинным рукавом", "Брюки", "Костюмный ансамбль",
    "Водолазка", "Пальто на подкладке", "Шуба", "Парка", "Пуховик", "Базовое шерстяное платье",
    "Свитер крупной вязки", "Кожаная юбка миди", "Шерстяные брюки", "Ботинки или сапоги до колена на меху",
    "Шапка", "Шарф", "Воротник из меха", "Перчатки"};

    public String[] getClothes(int temperature, boolean forMan) {
        if (temperature > 24) {
            return forMan ? manHot : womanHot;
        } else if (temperature > 10) {
            return forMan ? manCool : womanCool;
        } else {
            return forMan ? manCold : womanCold;
        }
    }
}
